[
    {
        "what": "Application Development Leader",
        "where": "Orion Advisor Technology",
        "start": "2021-12",
        "end": "2023-10",
        "description": "Led two high-performing, fully-remote teams: The Performance Squad built and maintained systems for real-time and scheduled trading performance analysis with historical and trending data. The Reporting Squad: Developed a drag-and-drop tool for traders and brokers to create and manage custom reports, along with APIs for seamless integration with other teams. Key Responsibilities: Managed daily operations in a hybrid role serving as the Development Manager and Scrum Master, Eliminated unnecessary meetings using Agile methodologies (Azure DevOps and Jira), Handled resource management for 8 developers, including reviews, hiring, training, and release verification; Improved team efficiency through DataDog monitoring and real-time data visualization; Delivered weekly metric reports for senior leadership utilizing Jira Reporting, Azure DevOps, Power BI, Sharepoint, and PowerPoint; Achieved significant reduction in production bugs and production incidents while also increasing development velocity.",
        "skills": [
            "AWS",
            "DataDog",
            "Visual Studio",
            ".NET",
            "C#",
            "HTML",
            "Angular",
            "AngularJS",
            "Software as a Service (SaaS)",
            "Micro-Services",
            "Git",
            "Jira",
            "Azure Dev Ops",
            "workplace",
            "Microsoft Teams",
            "Zoom",
            "Sharepoint",
            "Excel",
            "Power Automate"
        ]
    },
    {
        "what": "Principal Software Engineer",
        "where": "Moody’s Analytics",
        "start": "2014-09",
        "end": "2021-12",
        "description": "Led strategic development & execution for a vital web app: Managed a 12-engineer team serving 800+ global clients ($40M annual portfolio); Shaped industry-relevant development standards & training programs; Guided team through Agile practices as Scrum Master & coach; Ensured high-quality code & user experience through reviews & testing; Contributed to full-stack development when needed; Hired as Senior Software Engineer; Promoted to Lead Software Engineer in 2016; Promoted to Principal Software Engineer in 2020.",
        "skills": [
            "SQL",
            ".NET",
            "C#",
            "HTML5",
            "CSS",
            "LESS",
            "SASS",
            "JavaScript",
            "TypeScript",
            "WCF Services",
            "SaaS",
            "micro-services",
            "Serverless architecture",
            "Azure",
            " AWS",
            "jQuery",
            "Git"
        ]
    },
    {
        "what": "Senior Consultant",
        "where": "Midwest Cloud Computing",
        "start": "2013-08",
        "end": "2014-09",
        "description": "Served as application architect for startup company in the human resources sector. Product design centralized around a mobile-first approach  using cognitive and EQ analysis of people to build cohesive teams.",
        "skills": [
            ".NET",
            "C#",
            "PostgreSQL",
            "Angular",
            "Bootstrap",
            "HTML",
            "CSS",
            "SASS",
            "JavaScript",
            "Azure",
            "IIS ",
            "jQuery"
        ]
    },
    {
        "what": "Senior Consultant",
        "where": "Capstone Consulting",
        "start": "2012-01",
        "end": "2013-07",
        "description": "Designed and developed web applications to include Hardware Architecture, Data Architecture, Business Process Logic, and supporting services for thin-client applications in the agriculture industry. Architected the data migration from third-party product to Azure Cloud Application. Implemented thin-client web applications with WCF and rest services. Develop Android toolbox activities for potential projects. Evaluated PhoneGap Applications. Migrated Drupal Instance from MySQL to PostgreSQL. Created Web Service API for RESTful requests to access Drupal-managed resources.",
        "skills": [
            "SQL",
            ".NET",
            "C#",
            "Angular",
            "HTML",
            "CSS",
            "Azure",
            "WCF",
            "Rest",
            "MySQL",
            "Android",
            "PhoneGap",
            "Drupal",
            "PostgreSQL",
            "IIS",
            "Apache"
        ]
    },
    {
        "what": "Consultant",
        "where": "Client Resources Inc.",
        "start": "2011-08",
        "end": "2012-05",
        "description": "Supported internal applications by developing front-end interfaces for internal applications in Angular, TypeScript, and SCSS. Supported the development of a multitude of Android-based mobile apps. Developed Vanilla JavaScript-driven web application wrappers for the financial sector.",
        "skills": [
            "HTML",
            "Angular",
            "TypeScript",
            "SCSS",
            "CSS",
            "Javascript",
            "jQuery"
        ]
    },
    {
        "what": "Webmaster",
        "where": "Medico Insurance",
        "start": "2009-09",
        "end": "2011-06",
        "description": "Managed team of four software engineers; Developed and administered four enterprise level Java (J2EE, JSP, Struts) web applications. Upgraded applications from Tomcat 5.5/JDK 1.5 to Tomcat 7/ JDK 1.6; Implemented project development life-cycle; Implemented two-tier API enterprise middleware; Administered Windows 2003/2008 Servers; Updated enterprise web strategy Transitioned three HTML web sites to Drupal CMS; Developed PHP 5.3 / HTML5 / CSS3 / JQuery Templates and themes. Added functionality for iPad and mobile support.",
        "skills": [
            "Java",
            "J2EE",
            "JSP",
            "STruts",
            "Tomcat",
            "API",
            "Windows Server",
            "Drupal",
            "PHP",
            "HTML",
            "CSS",
            "jQuery",
            "mobile-web"
        ]
    },
    {
        "what": "Webmaster / Lead Coordinator",
        "where": "The Nebraska Medical Center",
        "start": "2008-07",
        "end": "2009-08",
        "description": "The Webmaster / Lead Coordinator, under the direction of the Director of  Marketing Services, and Vice President of Marketing and Strategic Planning, is responsible for the development and implementation of a hospital web strategy, in concert with marketing initiatives; manages the development and maintenance of all web initiatives; and works closely with managers, directors, and other key constituents in organization to develop and sustain working relationships necessary to advance a vibrant web presence in the community. Responsible for an application development team of twelve that developed and implemented hospital web strategy; managed the development and maintenance of all web initiatives; Implemented Social Media Campaigns; and key communications in coordination with disaster management.",
        "skills": [
            ".NET",
            "C#",
            "IIS",
            "SQL",
            "Rest",
            "HTML",
            "JavaScript",
            "CSS",
            "Social Media"
        ]
    },
    {
        "what": "Webmaster",
        "where": "RSI Medical Staffing",
        "start": "2006-04",
        "end": "2008-06",
        "description": "Managed a web team of four Developers; Engineered, Administered, and Developed a $7 million enterprise application. The project increased the performance of staff by 30%, reduced waste by 65%, and recovered $1.7 Million in annual lost revenue.  Served for six months as interim IT Director.",
        "skills": [
            "ASP.NET",
            "Visual Basic",
            "HTML",
            "CSS",
            "JavaScript",
            "Infrastructure",
            "Networking",
            "UI",
            "UX"
        ]
    },
    {
        "what": "Executive Support Applications Developer",
        "where": "PayPal Inc.",
        "start": "2005-11",
        "end": "2006-03",
        "description": "Developed PHP enterprise applications in direct support of Executive Leadership missions; Administered two Slackware Linux Servers (LAMP Stack), and one Windows 2003 Server (WAMP Stack).",
        "skills": [
            "Linux",
            "Apache",
            "MySQL",
            "PHP",
            " HTML",
            " JavaScript",
            "CSS",
            "Rest",
            "IIS",
            "Windows Server"
        ]
    },
    {
        "what": "Web Systems Engineer",
        "where": "Creighton University",
        "start": "2004-09",
        "end": "2005-11",
        "description": "Senior Typo3 CMS Developer/Administrator; Developed training materials for users and Admins; Designed 508 W3C Compliant templates.",
        "skills": [
            "Linux",
            "Apache",
            "MySQL",
            "PHP",
            "HTML",
            "JavaScript",
            "CSS",
            "Typo3"
        ]
    },
    {
        "what": "Web Developer Internship",
        "where": "Union Pacific Railroad",
        "start": "2004-01",
        "end": "2004-09",
        "description": "",
        "skills": [
            "Cold Fusion",
            "Flash",
            "Crystal Reports",
            "SQL",
            "Java",
            "Tibco"
        ]
    }
]
