[
    {
        "en": "Eric Miller - Professional Problem Solver & People Leader",
        "zh-Hans": "艾瑞克·米勒 - 专业问题解决者和人员领导者",
        "zh-TW": "艾瑞克·米勒 - 專業問題解決者和人員領導者",
        "es": "Eric Miller - Solucionador profesional de problemas y líder de personas",
        "ar": "إريك ميلر - حل الأمور المهني وقائد للناس",
        "pt": "Eric Miller - Solucionador profissional de problemas e líder de pessoas",
        "id": "Eric Miller - Penyelesaian Masalah Profesional & Pemimpin Orang",
        "fr": "Eric Miller - Résolveur de problèmes professionnel et leader de personnes",
        "ja": "エリック・ミラー - プロフェッショナルな問題解決者＆ピープルリーダー",
        "ru": "Эрик Миллер - Профессиональный решатель проблем и лидер людей",
        "de": "Eric Miller - Professioneller Problemlöser und People Leader"
    },
    {
        "en": "Eric Miller is a professional problem solver and people leader from Omaha, Nebraska. Eric is a Full-stack developer with over 20 years of experience.",
        "zh-Hans": "艾瑞克·米勒是来自内布拉斯加州奥马哈的专业问题解决者和人员领导者。 艾瑞克是一位具有超过20年经验的全栈开发人员。",
        "zh-TW": "艾瑞克·米勒是來自內布拉斯加州奧馬哈的專業問題解決者和人員領導者。 艾瑞克是一位具有超過20年經驗的全棧開發人員。",
        "es": "Eric Miller es un solucionador profesional de problemas y líder de personas de Omaha, Nebraska. Eric es un desarrollador full-stack con más de 20 años de experiencia.",
        "ar": "إريك ميلر هو حل الأمور المهني وقائد الناس من أوماها، نبراسكا. إريك هو مطور Full-stack بخبرة تزيد عن 20 عامًا.",
        "pt": "Eric Miller é um solucionador profissional de problemas e líder de pessoas de Omaha, Nebraska. Eric é um desenvolvedor full-stack com mais de 20 anos de experiência.",
        "id": "Eric Miller adalah penyelesaian masalah profesional dan pemimpin orang dari Omaha, Nebraska. Eric adalah pengembang Full-stack dengan pengalaman lebih dari 20 tahun.",
        "fr": "Eric Miller est un résolveur de problèmes professionnel et un leader de personnes d'Omaha, Nebraska. Eric est un développeur full-stack avec plus de 20 ans d'expérience.",
        "ja": "エリック・ミラーはネブラスカ州オマハ出身のプロの問題解決者であり、ピープルリーダーです。エリックは20年以上の経験を持つフルスタック開発者です。",
        "ru": "Эрик Миллер - профессиональный решатель проблем и лидер людей из Омахи, Небраска. Эрик - разработчик Full-stack с более чем 20-летним опытом.",
        "de": "Eric Miller ist ein professioneller Problemlöser und People Leader aus Omaha, Nebraska. Eric ist ein Full-Stack-Entwickler mit über 20 Jahren Erfahrung."
    },
    {
        "en": "A cartoon bust ninja with a round face, spikey yellow hair, white skin, and bright blue eyes",
        "zh-Hans": "一个卡通半身忍者，有圆脸，尖锐的黄发，白皮肤和明亮的蓝眼睛",
        "zh-TW": "一個卡通半身忍者，有圓臉，尖銳的黃髮，白皮膚和明亮的藍眼睛",
        "es": "Un ninja de caricatura con una cara redonda, cabello amarillo puntiagudo, piel blanca y ojos azules brillantes",
        "ar": "نينجا كاريكاتوري بوجه دائري وشعر أصفر مدبب وبشرة بيضاء وعيون زرقاء ساطعة",
        "pt": "Um ninja de desenho animado com um rosto redondo, cabelo amarelo espetado, pele branca e olhos azuis brilhantes",
        "id": "Seorang ninja kartun dengan wajah bulat, rambut kuning spike, kulit putih, dan mata biru terang",
        "fr": "Un ninja en buste de dessin animé avec un visage rond, des cheveux jaunes en pointes, une peau blanche et des yeux bleus vifs",
        "ja": "丸い顔、スパイキーな黄色の髪、白い肌、明るい青い目を持つカートゥーン風の忍者",
        "ru": "Карикатурный бюст ниндзя с круглым лицом, колючими желтыми волосами, белой кожей и ярко-голубыми глазами",
        "de": "Ein Cartoon-Büsten-Ninja mit rundem Gesicht, stacheligem gelbem Haar, weißer Haut und leuchtend blauen Augen"
    },
    {
        "en": "Hello",
        "zh-Hans": "你好",
        "zh-TW": "你好",
        "es": "Hola",
        "ar": "مرحبا",
        "pt": "Olá",
        "id": "Halo",
        "fr": "Bonjour",
        "ja": "こんにちは",
        "ru": "Привет",
        "de": "Hallo"
    }
]
